** Startup Performance

#+begin_src emacs-lisp

  ;; The default is 800 kilobytes.  Measured in bytes.
  (setq gc-cons-threshold (* 50 1000 1000))

  (defun my/display-startup-time ()
    (message "Emacs loaded in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                       (time-subtract after-init-time before-init-time)))
             gcs-done))

  (add-hook 'emacs-startup-hook #'my/display-startup-time)

#+end_src

#+RESULTS:
| my/display-startup-time | dashboard-initialize |

** Transparency
#+begin_src emacs-lisp

  ;; Set frame transparency
  (set-frame-parameter (selected-frame) 'alpha my/frame-transparency)
  (add-to-list 'default-frame-alist `(alpha . ,my/frame-transparency))
  (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))

#+end_src

#+RESULTS:
: ((fullscreen . maximized) (alpha 90 . 90) (vertical-scroll-bars) (left-fringe . 10) (right-fringe . 10))

*** Center Org Buffers
#+begin_src emacs-lisp
  (defun org-mode-visual-fill ()
    (setq visual-fill-column-width 100
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . org-mode-visual-fill))
#+end_src

#+RESULTS:
| org-mode-visual-fill | org-bullets-mode | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | org-mode-setup | (lambda nil (display-line-numbers-mode 0)) | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

*** org-bullets
#+begin_src emacs-lisp
  (use-package org-bullets
    :after org
    :hook (org-mode . org-bullets-mode)
    :custom ;; ❇ ⬢ ⦿ ◈ ✤ ⬟ ❖
    (org-bullets-bullet-list '("✸" "★" "◈")))
#+end_src

#+RESULTS:
| org-bullets-mode | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | org-mode-setup | (lambda nil (display-line-numbers-mode 0)) | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

** The TODO system setup
#+begin_src emacs-lisp

  (defun my/org-todo-setup ()
     (setq org-todo-keywords
           '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d)")
             (sequence "WAITING(w@/!)" "HOLD(h@/!)" "|" "CANCELLED(c@/!)")))
     (setq org-todo-keyword-faces
           (quote (("TODO" :foreground "red" :weight bold)
                   ("NEXT" :foreground "tomato" :weight bold)
                   ("DONE" :foreground "forest green" :weight bold)
                   ("WAITING" :foreground "orange" :weight bold)
                   ("HOLD" :foreground "magenta" :weight bold)
                   ("CANCELLED" :foreground "forest green" :weight bold))))
     (setq org-use-fast-todo-selection t))

  ; PROJECT tag for project
  (setq org-stuck-projects
      '("+PROJECT/-DONE" ("NEXT") nil ""))

#+end_src

#+RESULTS:
| +PROJECT/-DONE | (NEXT) | nil |   |

** The Org Setup

#+begin_src emacs-lisp

  (defun xing/save-org-buffers ()
    "Save `org-agenda-files' buffers without user confirmation.
    See also `org-save-all-org-buffers'"
    (interactive)
    (message "Saving org-agenda-files buffers...")
    (save-some-buffers t (lambda () 
                           (when (member (buffer-file-name) org-agenda-files) 
                             t)))
    (message "Saving org-agenda-files buffers... done"))

  (use-package org
    :hook
    (org-mode . org-mode-setup)
    (org-agenda-mode . xing/org-agenda-custom-key)
    :config
    (setq org-ellipsis " ▾")
    (setq org-directory my/org-folder)
    (setq org-agenda-files (list my/org-tasks-folder "~/.emacs.d/config.org"))
    (setq org-default-notes-file (concat my/org-tasks-folder "/refile.org"))
    (setq org-agenda-start-with-log-mode t)
    (setq org-clock-idle-time nil)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)
    (setq org-cycle-separator-lines -1) ;; use a single line of blank as seperator
    (setq org-startup-with-inline-images t) ;; toggle inline images
    ;; (setq org-pretty-entities t) ;; like \{pi} to the symbol pi
    (setq org-hide-emphasis-markers t) ;; hide markers like *bold*, /italic/


    (my/org-font-setup)
    (my/org-todo-setup)
    (xing/org-custom-agenda)
    (xing/org-capture-setup)
    (xing/org-refile-setup)

    (advice-add 'org-refile :after
                (lambda (&rest _)
                  (xing/save-org-buffers)))
    )
#+end_src

#+RESULTS:
| xing/org-agenda-custom-key |

** Org Babel
#+begin_src emacs-lisp

  (use-package ob-mermaid)

  (use-package jupyter)

  (with-eval-after-load 'org
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (python . t)
       (jupyter . t)
       (plantuml . t)
       (mermaid . t)
       ))

    (push '("conf-unix" . conf-unix) org-src-lang-modes))

  (setq my/org-view-html-tmp-dir "/tmp/org-html-preview/")

  (use-package f)

  (defun my/org-view-html ()
    (interactive)
    (let ((elem (org-element-at-point))
          (temp-file-path (concat my/org-view-html-tmp-dir (number-to-string (random (expt 2 32))) ".html")))
      (cond
       ((not (eq 'export-block (car elem)))
        (message "Not in an export block!"))
       ((not (string-equal (plist-get (car (cdr elem)) :type) "HTML"))
        (message "Export block is not HTML!"))
       (t (progn
            (f-mkdir my/org-view-html-tmp-dir)
            (f-write (plist-get (car (cdr elem)) :value) 'utf-8 temp-file-path)
            (message temp-file-path)
            (unless 
              (message "starting eww...")
              (eww "https://www.bing.com/"))
            (switch-to-buffer-other-window "*eww*")
            (eww-open-file temp-file-path)
            ;;(start-process "org-html-preview" nil "xdg-open" temp-file-path)
            ;; switch-to-buffer-other-window
            ;; create a new buffer
            )))))

#+end_src

#+RESULTS:
: ((conf-unix . conf-unix) (plantuml . plantuml) (C . c) (C++ . c++) (asymptote . asy) (bash . sh) (beamer . latex) (calc . fundamental) (cpp . c++) (ditaa . artist) (desktop . conf-desktop) (dot . fundamental) (elisp . emacs-lisp) (ocaml . tuareg) (screen . shell-script) (shell . sh) (sqlite . sql) (toml . conf-toml))

** Structure Templates

#+begin_src emacs-lisp

  (with-eval-after-load 'org
    ;; This is needed as of Org 9.2
    (require 'org-tempo)

    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("mr" . "src mermaid :file images/"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))
    (add-to-list 'org-structure-template-alist '("jp" . "src jupyter-python"))
    )

#+end_src

#+RESULTS:
: ((py . src python) (el . src emacs-lisp) (sh . src shell) (a . export ascii) (c . center) (C . comment) (e . example) (E . export) (h . export html) (l . export latex) (q . quote) (s . src) (v . verse))

*** Rainbow Delimiters

#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

#+RESULTS:
| rainbow-delimiters-mode |

*** LSP Mode
#+begin_src emacs-lisp

  (defun my/lsp-mode-setup ()
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-mode))

  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook (lsp-mode . my/lsp-mode-setup)
    :init
    (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
    :config
    (lsp-enable-which-key-integration t))

#+end_src

#+RESULTS:
| lsp-ui-mode | my/lsp-mode-setup |

*** LSP UI
#+begin_src emacs-lisp

  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom))

#+end_src

#+RESULTS:
| lsp-ui-mode | my/lsp-mode-setup |

** Company

Use company everywhere.
#+begin_src emacs-lisp
  (use-package company
    :after lsp-mode
    :hook (lsp-mode . company-mode)
    :bind (:map company-active-map
           ("<tab>" . company-complete-selection))
          (:map lsp-mode-map
           ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))

  (use-package company-box
    :hook (company-mode . company-box-mode))
#+end_src

#+RESULTS:
| company-box-mode | company-mode-set-explicitly |

*** flycheck integration

#+begin_src emacs-lisp
  (setq elpy-modules (delq 'elpy-module-flymake elpy-modules))
  (add-hook 'elpy-mode-hook 'flycheck-mode)
#+end_src

#+RESULTS:
| flycheck-mode |

* Runtime Performance

Dial the GC threshold back down so that garbage collection happens more frequently but in less time.

#+begin_src emacs-lisp

  ;; Make gc pauses faster by decreasing the threshold.
  (setq gc-cons-threshold (* 2 1000 1000))

#+end_src

#+RESULTS:
: 2000000
